Enter file contents here
#include"stdio.h"
#include"math.h"
int main()
{
	double p0,p1,p2,p3,p4,p5,r0,r1,r2,r3,r5;//定义各变量，均为double型
		p0=1000,r0=0.0072,r1=0.0414,r2=0.468,r3=0.0514,r5=0.0585;//输入数据
		p1=p0*((1+r5*5);//一次存五年期
        p2=p0*(1+2*r2)*(1+3*r3);//先存2年期，到期后将本息再存3年期
		p3=p0*(1+3*r3)*(1+2*r2); //先存3年期，到期后将本息再存2年期
		p4=p0*pow(1+r1,5);//存1年期，到期后将本息在存一年期，连续存五年
		p5=p0*pow(1+r0/4,20);//存活期存款，活期利息每一季度结算一次
		printf("p1=%f\np2=%f\np3=%f\np4=%f\np15=%f\n",p1,p2,p3,p4,p5);//依次输出五种//方案的本息和
		return 0;
}
